Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སོ་སོར་བརྟགས་པའི་སྟོབས་ཀྱིས་དང་དུ་ལེན་པ་གང་ཡིན་པ་དེ་ནི་བརྒལ་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience for crossing over is an undeterred acceptance that is due to the strength of analysis.

source: འདོད་པའི་རྣམ་པར་རྟོག་པ་སྤང་བའི་ཕྱིར་ངེས་པར་འབྱུང་བའི་རྣམ་པར་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བརྒལ་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence for crossing over consists of thoughts of deliverance aimed at giving up desirous thoughts.

source: རྣམ་པར་འཚེ་བ་སྤང་བའི་ཕྱིར་བསྙེམས་པ་མེད་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བརྒལ་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration for crossing over is concentration free from conceit that is aimed at giving up harm.

source: ཁམས་གསུམ་པའི་སྡུག་བསྔལ་གྱི་མཚན་ཉིད་ལ་ཉེ་བར་རྟོག་པ་བདག་མེད་པས་ངེས་པར་བྱུང་བ་གང་ཡིན་པ་དེ་ནི་བརྒལ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight for crossing over is deliverance by understanding the characteristics of suffering throughout the three realms as well as the absence of self.

source: འདི་དག་ནི་བརྒལ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections for crossing over.

source: དེ་ལ་མངོན་པར་དགའ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of joyfulness?

source: འདོད་པ་ཐམས་ཅད་འབྱོར་པར་བྱ་བའི་ཕྱིར་ལྷ་དང་མིའི་འགྲོ་བར་རྣམ་པར་སྨིན་པར་འགྱུར་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ང་རྒྱལ་མེད་པ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་དགའ་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on joyfulness is the perfection of generosity aimed at obtaining all pleasures and ripens within the realms of gods and humans.

source: ལྷ་དང་མིའི་འགྲོ་བ་དག་ཏུ་ཚེ་རིང་བར་འགྱུར་བའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་མངོན་པར་དགའ་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on joyfulness is discipline that leads to longevity within the realms of gods and humans.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་དགའ་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on joyfulness is acceptance that phenomena are nonarising.

source: རྩོལ་བ་དང་བཅས་པའི་བརྩོན་འགྲུས་ཀྱི་འབྲས་བུ་ཡོད་པ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་དགའ་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on joyfulness is diligence that involves effort and bears fruit.

source: བདག་ཉིད་ཡོན་ཏན་གྱི་རྣམ་པ་ཐོབ་པར་བྱ་བའི་ཕྱིར་དང་བདག་དང་གཞན་ལ་ཕན་པའི་རྣམ་པར་སྨིན་པའི་རྒྱུའི་ཕྱིར་དང་། སྨོན་ལམ་གྱི་འབྲས་བུ་ཐོབ་པར་བྱ་བའི་ཕྱིར་དང་། ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པར་འགྱུར་བའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་མངོན་པར་དགའ་བའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on joyfulness is concentration aimed at attaining excellent qualities, or a ripening that benefits both oneself and others, or the results of aspiration prayers, or a correct understanding.

source: དེ་བཞིན་གཤེགས་པའི་སྤྱོད་པ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱེད་པའི་ཕྱིར་ཆོས་ཉན་པ་ནི་མངོན་པར་དགའ་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on joyfulness is to listen to the Dharma in order to comprehend all the practices of the thus-gone ones.

source: འདི་དག་ནི་མངོན་པར་དགའ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of joyfulness.

source: དེ་ལ་མངོན་པར་དགའ་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of joylessness?

source: ནོར་དང་ཟས་དང་གོས་ལ་སོགས་པ་ལ་མ་ཆགས་ཤིང་། ལན་ལ་རེ་བ་མེད་པའི་ཚུལ་གྱིས་ཡོངས་སུ་གཏོང་བར་བྱེད་པ་ནི་མངོན་པར་དགའ་བ་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on joylessness is to be detached from wealth, food, clothing, and so forth, thus giving freely without any expectation of reward.

source: ངེས་པར་འབྱུང་བ་དང་ལྡན་པ་ཁྱིམ་ན་གནས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་མངོན་པར་དགའ་བ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on joylessness is the discipline of a renunciant who dwells within a household.

source: འགྱོད་པ་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་དགའ་བ་མེད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on joylessness is the acceptance of regret.

source: སྡུག་བསྔལ་སྤང་བའི་ཕྱིར་བརྩོན་པ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་དགའ་བ་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on joylessness is to endeavor for the sake of relinquishing suffering.

source: རིས་མི་འཐུན་པར་སོང་སྟེ་སྡུག་བསྔལ་ཡང་དག་པར་འབྱུང་བ་དང་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་མཚུངས་པར་ལྡན་པའི་མཚན་ཉིད་ཅན་གྱི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་མངོན་པར་དགའ་བ་མེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on joylessness is concentration that is characterized by conflicting factors and the manifestation of suffering, as well as thoughts of attachment and anger.

source: བྱང་ཆུབ་སེམས་དཔའ་དམིགས་པ་ཅན་ཁམས་གསུམ་ལ་མངོན་པར་དགའ་བ་མེད་པའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་དགའ་བ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on joylessness is the insight of a bodhisattva who maintains focal points and has no fondness for the three realms.

source: འདི་དག་ནི་མངོན་པར་དགའ་བ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of joylessness.

source: དེ་ལ་ཐོས་པ་འཛིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections for the retention of learning?

source: གང་ཟག་ལ་ཆོས་ཀྱི་སྦྱིན་པ་གང་ཡིན་པ་འདི་དང་། སྟོན་པ་དང་། ཁ་ཏོན་བྱེད་དུ་འཇུག་པ་དང་། འཛིན་དུ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་ཐོས་པ་འཛིན་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on the retention of learning is giving the gift of Dharma to a person through teaching and causing that person to recite and retain the Dharma.

source: དགེ་བའི་རྩ་བའི་ཆོས་ཀྱི་ཚིག་བདུན་གྱིས་ལུས་དང་ངག་དང་། སེམས་ཀྱི་ཚུལ་ཁྲིམས་ཡོངས་སུ་སྤྱོད་པར་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་ཐོས་པ་འཛིན་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on the retention of learning is to encourage others to practice and retain the physical, verbal, and mental discipline associated with the seven Dharma topics on the roots of virtue.

source: ལེགས་པར་གསུངས་པའི་ཚིག་གཅིག་ཙམ་གྱི་ཆེད་དུ་སྡུག་བསྔལ་དང་དུ་ལེན་པ་གང་ཡིན་པ་དེ་ནི་ཐོས་པ་འཛིན་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of patience based on the retention of learning is an undaunted acceptance of suffering for the sake of even a single word of the well-spoken teachings.

source: བྱང་ཆུབ་སེམས་དཔའ་བྲམ་ཟེར་གྱུར་པ་ན་སྐྱེས་པའི་རབས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་དོན་དུ་གདོལ་པ་ལས་མཉན་པའི་ཕྱིར། ལོ་བཅུ་གཉིས་སུ་བཀུར་སྟི་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་ཐོས་པ་འཛིན་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: This is how, when the Bodhisattva was a brahmin, he served an outcaste for twelve years for the sake of listening to teachings from him in order to comprehend the succession of births.

source: ངེས་པར་འབྱུང་བ་ལ་དམིགས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་ཐོས་པ་འཛིན་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on the retention of learning is diligence focused on deliverance.

source: སེམས་མི་རྟག་པ་ལ་དམིགས་པ་གང་ཡིན་པ་དེ་ནི་ཐོས་པ་འཛིན་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on the retention of learning is a mind that is focused on impermanence.

source: སློབ་དཔོན་གྱི་དཔེ་མཁྱུད་མེད་པས་མཛའ་བ་དང་མི་མཛའ་བ་རྣམས་ཡང་དག་པའི་དགེ་བ་ལ་སྦྱོར་དུ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་ཐོས་པ་འཛིན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on the retention of learning is to equally encourage friends and foes to virtuous practice, since one is not a teacher who holds back on teaching.

source: འདི་དག་ནི་ཐོས་པ་འཛིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections for the retention of learning.

source: དེ་ལ་འཁོར་བར་ཡུན་རིང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections for a long stay in saṃsāra?

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པར་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡུན་རིང་བར་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity for a long stay in saṃsāra is generosity that is dedicated to the acceptance that phenomena are nonarising.

source: སྙིང་རྗེ་ཆེན་པོས་རྣམ་པར་ཐོ་འཚམ་པ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡུན་རིང་བར་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline for a long stay in saṃsāra is the perfection of discipline that is free from harming others due to great compassion.

source: སྨོན་ལམ་གྱི་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡུན་རིང་བར་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience for a long stay in saṃsāra is patience that is developed through aspiration prayers.

source: ཐོས་པར་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡུན་རིང་བར་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence for a long stay in saṃsāra is diligence that is dedicated to hearing the Dharma.

source: བདག་མེད་པའི་རྣམ་པར་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡུན་རིང་བར་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration for a long stay in saṃsāra is concentration that is focused on the absence of self.

source: ཕྱིར་མི་ལྡོག་པའི་སའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་འཁོར་བར་ཡུན་རིང་བར་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight for a long stay in saṃsāra is the insight on the level of irreversibility.

source: འདི་དག་ནི་འཁོར་བར་ཡུན་རིང་བར་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections for a long stay in saṃsāra.

source: དེ་ལ་རྒྱུན་ཆད་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the are six perfections without disruption?

source: བསྡུ་བའི་དངོས་པོ་བཞི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྒྱུན་ཆད་པ་མེད་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity without disruption is generosity through the four means of attracting disciples.

source: ལེགས་པར་སྤྱོད་པ་རྣམ་པ་གསུམ་གྱིས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྒྱུན་ཆད་པ་མེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline without disruption is the perfection of discipline in terms of the three modes of perfect conduct.

source: ལུས་དང་སེམས་དང་། སོ་སོར་བརྟགས་པའི་བཟོད་པ་དང་། ཆོས་ལ་བཟོད་པ་ནི་བཟོད་པ་བཞི་པོ་སྟེ། བཟོད་པ་གང་ཡིན་པ་དེ་དག་ནི་རྒྱུན་ཆད་པ་མེད་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience without disruption is patience of four kinds: patience relating to the body, patience relating to mind, patience based on analysis, and patient acceptance of phenomena.

source: ཡང་དག་པའི་སྤོང་བ་བཞིས་མ་ཐོགས་ཤིང་ཀུན་ནས་དཀྲིས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་རྒྱུན་ཆད་པ་མེད་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence without disruption is being unimpeded and imperturbable by means of the four bases of miraculous power.

source: དྲན་པ་ཉེ་བར་གཞག་པ་བཞིས་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་རྒྱུན་ཆད་པ་མེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration without disruption is the perfection of concentration by means of the four applications of mindfulness.

source: བདེན་པ་བཞི་རབ་ཏུ་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་རྒྱུན་ཆད་པ་མེད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight without disruption is full knowledge of the four truths.

source: འདི་དག་ནི་རྒྱུན་ཆད་པ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections without disruption.

source: དེ་ལ་འདོད་པའི་ཡོན་ཏན་ཡོངས་སུ་སྨིན་པར་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that are dedicated to ripening as sense pleasures?

source: བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་འདོད་པའི་ཡོན་ཏན་ཡོངས་སུ་སྨིན་པར་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ལ། དེ་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་ལ་བལྟ་བར་བྱ་བ་དེ་ཡང་འདོད་པའི་ཡོན་ཏན་ཡོངས་སུ་སྨིན་པར་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity that is dedicated to ripening as sense pleasures is generosity that relinquishes all possessions. Although it is regarded as the emptiness gateway to liberation it is still the perfection of generosity that is dedicated to ripening as sense pleasures.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་ཕན་པའི་སེམས་ཀྱིས་གང་སྐྱེ་བ་དང་། འདོད་པ་ན་སྤྱོད་པར་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་འདོད་པའི་ཡོན་ཏན་ཡོངས་སུ་སྨིན་པར་བསྔོས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline that is dedicated to ripening as sense pleasures is discipline that is benevolently dedicated to taking birth and living in the desire realm in order to ripen sentient beings.

source: ཡོངས་སུ་བརྟུལ་ན་རྗེས་སུ་འཐུན་པའི་ཡུལ་ལ་དང་དུ་ལེན་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་འདོད་པའི་ཡོན་ཏན་ཡོངས་སུ་སྨིན་པར་བསྔོས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience that is dedicated to ripening as sense pleasures is acceptance of conducive objects in the context of training.

source: འཇིག་རྟེན་པའི་སེམས་ཀྱི་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་སྨིན་པར་བྱས་པའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་འདོད་པའི་ཡོན་ཏན་ཡོངས་སུ་སྨིན་པར་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence that is dedicated to ripening as sense pleasures is diligence that is made to ripen in accordance with the wishes of the mundane mind.

source: དུས་ཤེས་པ་དང་རབ་ཏུ་ལྡན་པའི་ཚད་མེད་པ་བྱམས་པ་དང་སྙིང་རྗེ་གཉིས་པོ་འདི་དག་གིས་ཕ་རོལ་སྡུག་བསྔལ་བདག་བདེ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་འདོད་པའི་ཡོན་ཏན་ཡོངས་སུ་སྨིན་པར་བསྔོས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration that is dedicated to ripening as sense pleasures is the process of making others who suffer happy by means of love and compassion, and an understanding of the right time.

source: དཔྱོད་པ་ལ་རབ་ཏུ་སྦྱོར་ཞིང་དུས་དང་དུས་མ་ཡིན་པ་ལ་ལྟོས་པ་བྱམས་པ་དང་། སྙིང་རྗེའི་བདག་ཉིད་གང་ཡིན་པ་དེ་ནི་འདོད་པའི་ཡོན་ཏན་ཡོངས་སུ་སྨིན་པར་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight that is dedicated to ripening as sense pleasures is love and compassion that are discerning and assisted by an understanding of what is, and what is not, the right time.

source: འདི་དག་ནི་འདོད་པའི་ཡོན་ཏན་ཡོངས་སུ་སྨིན་པར་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that are dedicated to ripening as sense pleasures.

source: དེ་ལ་བསམ་གཏན་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections dedicated through concentration?

source: སྦྱིན་པས་བྱིན་གྱིས་བརླབས་པས་གང་དང་གང་དུ་འདོད་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity dedicated through concentration is the giving of whatever is desired by means of blessings.

source: སེམས་དང་རབ་ཏུ་ལྡན་པའི་ཚུལ་ཁྲིམས་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on concentration is discipline that is fully attentive.

source: ཆོས་ཀྱི་ངོ་བོ་མཉམ་པ་ཉིད་དུ་བརྟགས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on concentration is patience that is based on the comprehension of the essential equality of all things.

source: སེམས་ཀྱི་ཀུན་ནས་དཀྲིས་པ་རྣམ་པར་སེལ་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on concentration is diligently dispelling the fetters of the mind.

source: ཐོས་པའི་བདག་ཉིད་ཀྱི་ཤེས་རབ་ཀྱི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on concentration is insightful concentration that is of the nature of learning.

source: འདོད་ཆགས་རབ་ཏུ་ཞི་བའི་ཤེས་རབ་ཀྱི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight based on concentration is insightful concentration that quells desire.

source: འདི་དག་ནི་བསམ་གཏན་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections dedicated through concentration.

source: དེ་ལ་མངོན་པར་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of superknowledge?

source: མར་མེ་ཕུལ་བའི་རྣམ་པར་སྨིན་པ་ལྷའི་མིག་འགྲུབ་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་ཤེས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity based on superknowledge is the accomplishment of the divine eye through the offering of butter lamps.

source: ལྷའི་རྣ་བ་འགྲུབ་པར་འགྱུར་བ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མ་ཞིག་པ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་ཤེས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline based on superknowledge is the unbroken perfection of discipline that accomplishes the divine ear.

source: སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པ་འགྲུབ་པར་བྱེད་པ་གཉིས་སུ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་ཤེས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience based on superknowledge is patience that accomplishes the recollection of past lives and is dedicated to nondual wisdom.

source: སེམས་ཅན་ལ་དམིགས་ཤིང་འཇིག་རྟེན་པའི་དགེ་བའི་རྩ་བ་ཡང་དག་པར་འགྲུབ་པ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་ཤེས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence based on superknowledge is diligence that is focused on sentient beings and that accomplishes mundane roots of virtue.

source: རྫུ་འཕྲུལ་བསྒྲུབ་པ་དང་། འགོག་པར་ཤེས་པ་རྒྱས་པར་བྱེད་པ་དང་། སྙོམས་པར་འཇུག་པ་ཡོངས་སུ་འཛིན་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་མངོན་པར་ཤེས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration based on superknowledge is concentration that accomplishes miraculous feats, unfolds the knowledge of cessation, and adheres to meditative attainment.

source: དེ་ལས་བྱུང་བ་སེམས་ཀྱི་རྣམ་གྲངས་ཤེས་པའི་མངོན་པར་ཤེས་པ་དང་། ཟག་པ་ཟད་པར་འགྱུར་བའི་མངོན་པར་ཤེས་པ་དང་། འགོག་པའི་སྙོམས་པར་འཇུག་པ་ལས་བྱུང་བའི་ཤེས་རབ་གང་ཡིན་པ་དེ་ནི་མངོན་པར་ཤེས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: From that emerges the perfection of insight based on superknowledge—superknowledge of the categories of the mind, superknowledge of the exhaustion of contaminants, and insight emerging from the meditative attainment of cessation.

source: འདི་དག་ནི་མངོན་པར་ཤེས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of superknowledge.

source: དེ་ལ་འཇིག་རྟེན་པའི་བཟོའི་གནས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections for mundane fields of artistry?

source: འདི་ལྟར་བཟོ་གཞན་དེ་དག་གི་ནང་ནས་འཇིག་རྟེན་པའི་བཟོ་ལེགས་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The ripening of generosity is what becomes most excellent among such other mundane fields of artistry.

source: སྐྱེ་བོ་མང་པོ་དགའ་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: The ripening of discipline is to become delighted in multitudes of people.

source: བཟོ་ཐམས་ཅད་ལ་མ་ལུས་པར་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The ripening of patience yields a comprehensive knowledge of all crafts and sciences.

source: མྱུར་བར་མངོན་དུ་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱི་རྣམ་པར་སྨིན་པའོ། །
en: The ripening of diligence consists in swift actualization.

source: ཡིད་བཞིན་དུ་འགྲུབ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱི་རྣམ་པར་སྨིན་པའོ། །
en: The ripening of concentration is accomplishment according to one’s wishes.

source: མི་འཁོར་བར་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The ripening of insight is knowing how not to cycle in saṃsāra.

source: འདི་དག་ནི་འཇིག་རྟེན་པའི་བཟོའི་གནས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections for mundane fields of artistry.

source: དེ་ལ་བྱམས་པས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections dedicated through loving kindness?

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པའི་དོན་དུ་སེམས་ཀྱི་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་བྱམས་པས་ཡོངས་སུ་བསྔོས་པའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of generosity dedicated through loving kindness is to mentally give for the sake of protecting all sentient beings.

source: དཔེར་ན་རི་བོང་བདག་ཉིད་གཏོང་བ་ནི་ང་ཟོ་ལ་འདིར་འདུག་ཤིག་ཅེས་བྱ་བ་ལྟ་བུའོ། །
en: For example, it is like the hare that sacrificed himself, saying, ‘Stay here and eat me.’

source: སྙིགས་མའི་དུས་ཀྱི་ཚེ་སྨོན་ལམ་གྱི་དབང་གིས་སྐྱེ་བ་བྱས་ནས། སེམས་ཅན་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་རབ་ཏུ་འགོད་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བྱམས་པས་ཡོངས་སུ་བསྔོས་པའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of discipline dedicated through loving kindness is to take birth in a dark age by the power of aspirations and thereby cause beings to embrace and become established in the ten avenues of virtuous action.

source: དཔེར་ན་སྲེག་པའི་སྐྱེས་པའི་རབས་དང་། ནེ་ཙོའི་སྐྱེས་པའི་རབས་ལྟ་བུའོ། །
en: As examples, this is like the Bodhisattva’s previous births as a quail and a parrot.

source: དུས་ཤེས་པ་དང་མཚུངས་པར་ལྡན་པ་གང་ཡིན་པ་དེ་ནི་བྱམས་པས་ཡོངས་སུ་བསྔོས་པའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of patience dedicated through loving kindness is associated with the knowledge of time.

source: དཔེར་ན་ཡུལ་ཀ་ཤིའི་རྒྱལ་པོ་མགོ་བཅད་ཀྱང་སེམས་མི་འཁྲུགས་པ་ལྟ་བུའོ། །
en: For example, this is like the King of Kāśī who remained unperturbed even as his head was cut off.

source: སྐྱེ་བོ་མང་པོ་མཐོ་རིས་སུ་འགྲོ་བར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བྱམས་པས་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of diligence dedicated through loving kindness is what leads many beings to the higher realms.

source: དཔེར་ན་བྲམ་ཟེའི་བུ་ཀུན་དུ་བཟང་དང་། ཀུན་དུ་རྒྱུ་བློ་ཅན་གཉིས་བརྙས་པ་བཟོད་པ་ལྟ་བུ་སྟེ།
en: For example, when the brahmin Subhadra and the vagrant Intelligent One accepted blame,

source: དེ་ནི་བྱམས་པས་ཡོངས་སུ་བསྔོས་པའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: they were practicing the perfection of diligence dedicated through loving kindness.

source: ཚད་མེད་པ་མངོན་པར་བསྒྲུབས་པའི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བྱམས་པས་ཡོངས་སུ་བསྔོས་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of concentration that is dedicated through loving kindness is concentration that accomplishes the immeasurable states.

source: སྐྱེ་བོ་མང་པོ་རྣམ་པར་སྨིན་པར་བྱ་བའི་ཕྱིར། །དཔེར་ན་སྐྱེད་པ་པོ་དང་། སྨན་ཆེན་གྱིས་རྒྱལ་པོའི་གྱོས་པོ་ཚར་བཅད་ཀྱང་རྣམ་པར་ཐོ་བཙམས་པ་ཡང་མེད་ལ། ཆུ་བོར་ཡང་མ་ཞུགས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་བྱམས་པས་ཡོངས་སུ་བསྔོས་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight dedicated through loving kindness is insight aimed at ripening many beings. For example, this is like Janaka and Mahauṣadha, who defeated his king’s father-in-law without causing any harm and without entering the river.

source: འདི་དག་ནི་བྱམས་པས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections dedicated through loving kindness.

source: དེ་ལ་སྙིང་རྗེས་ཡོངས་སུ་བསྔོས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections dedicated through compassion?

source: སེམས་ཅན་བདེ་བར་བྱ་བའི་སེམས་ཀྱིས་སྦྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྙིང་རྗེ་ལས་བྱུང་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity that arises from compassion is giving to make sentient beings happy.

source: ཁ་ན་མ་ཐོ་བ་རྡུལ་ཙམ་གྱིས་བདག་ཀྱང་ཉམས་པ་མེད་པ་ཡིན་ལ། སྐྱོ་བ་མེད་པས་གཞན་ལ་ཡང་རྗེས་སུ་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་སྙིང་རྗེ་ལས་བྱུང་བའི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of discipline that arises from compassion is to remain free from even a speck of unwholesomeness while also untiringly teaching others.

source: ཚིག་ངན་བརྗོད་པ་དག་བདག་དང་དུ་ལེན་པའི་རིགས་ཅན་ཡང་ཡིན་ལ། །གཞན་ལ་ཡང་བཟོད་པ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་སྙིང་རྗེ་ལས་བྱུང་བའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of patience that arises from compassion is willingness to accept abusive words oneself while also encouraging others to be patient.

source: བརྩོན་འགྲུས་བརྩམས་པས་ཡོངས་སུ་སྐྱོ་བ་མེད་པར་དགེ་བའི་ཆོས་རྣམས་ཚོལ་བ་དང་། སེམས་ཅན་མང་པོ་བཀྲོལ་བ་དང་། སེམས་ཅན་རྣམས་ངེས་པར་འབྱིན་པ་ལ་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་སྙིང་རྗེ་ལས་བྱུང་བའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of diligence that arises from compassion is to diligently and untiringly pursue the cultivation of virtuous factors, liberate numerous beings, and encourage others to embrace deliverance.
